# Tabs ( repos )
# =========================

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Brews ( Packages )
# =========================

# git 
brew "git"
brew "git-lfs"

# utilities
brew "bat"
brew "exa"
brew "httpie"
brew "youtube-dl"

# images & videos 
brew "ffmpeg"
brew "imagemagick"

# ruby
brew "rbenv"
brew "cocoapods"
brew "fastlane"

# python 
brew "python@3.9"
brew "pyenv"

# java 
brew "openjdk"


# Casks ( Applications )
# =========================

cask "alfred"
cask "dropbox"
cask "google-chrome"
cask "visual-studio-code"
