tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Dependency manager for Cocoa projects
brew "cocoapods", link: false
# Modern replacement for 'ls'
brew "exa"
# Easiest way to build and release mobile apps
brew "fastlane"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Development kit for the Java programming language
brew "openjdk"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
mas "Asset Catalog Creator", id: 866571115
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "pomodorome", id: 1484801884
mas "RAR Extractor and Expander", id: 1071663619
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 1147396723
mas "Xnip", id: 1221250572
